Revit 2024 API
BuiltInFailures.ScheduleViewFailures.NoColumnsJoinedToGridLines Property
 No columns are joined to grid lines, or view parameters exclude all columns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoColumnsJoinedToGridLines { get; }
Visual Basic
Public Shared ReadOnly Property NoColumnsJoinedToGridLines As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoColumnsJoinedToGridLines {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace